smallinvoice-api-test/src/test/resources/receivables/invoice1.json

{
  "id": null,
  "number": null,
  "contact_id": null,
  "contact": null,
  "contact_address_id": null,
  "contact_address": null,
  "date": null,
  "due": null,
  "currency": "CHF",
  "total": null,
  "vat_included": false,
  "discount_rate": 0.0,
  "discount_type": "P",
  "total_paid": 0.0,
  "isr_id": null,
  "isr_position": "A",
  "isr_reference_number": "000000000000000000000001029",
  "payment_link_paypal": false,
  "payment_link_postfinance": false,
  "payment_link_payrexx": false,
  "payment_link_smartcommerce": false,
  "language": "de",
  "layout_id": null,
  "status": "R1",
  "created": null,
  "custom_fields": [],
  "positions": [
    {
      "type": "N",
      "catalog_type": "P",
      "number": null,
      "name": "Schrauben 8x30mm",
      "description": "",
      "price": 0.18,
      "vat": 7.7,
      "amount": 2.0,
      "unit_id": 7,
      "total": 0.39,
      "show_only_total": false
    },
    {
      "type": "N",
      "catalog_type": "S",
      "number": null,
      "name": "Lieferung",
      "description": "",
      "price": 200.0,
      "vat": 7.7,
      "amount": 5.0,
      "unit_id": 13,
      "total": 1077.0,
      "show_only_total": false
    }
  ],
  "texts": [
    {
      "status": "D",
      "title": "Rechnung Nr. {INVOICENO} / Kunden Nr. {CUSTOMERNO}",
      "introduction": "",
      "conditions": ""
    }
  ],
  "free_texts": [],
  "workflow": [],
  "permissions": null
}
